[{
    "title_articles":"كل ما يتعلق بالبرمجة",
    "contents_the_articles":"محتويات المقالة",
    "link_one":"ما هي البرمجة",
    "link_tow":"لماذا يجب عليك تعلم البرمجة",
    "link_three":"اهمية تعلم البرمجة",
    "link_four":"مسارات تعلم البرمجة",
    "link_five":"ماذا تحتاج لتعلم البرمجة",
    "link_six":"نهاية المقال",
    "the_start":"مرحبا بكم في مدونة برمجة...",
    "about":"في هذه المقالة سوف نتحدث عن كل ما يتعلق بمجال البرمجة"
    ,"span_one":"ما هي البرمجة ؟",
    "programming":"البرمجة",
    "programming_p":"هي عبارة عن كتابة أوامر لجهاز الحاسوب ليقوم بترجمتها وتنفيذها حيث يقوم كاتب الأكواد (المبرمج) بكتابة الأوامر او التعليمات ثم يقوم جهاز الحاسوب بتحويل الاوامر او التعليمات الى الشيء او الى الفكرة التي يريدها المبرمج من عملية حسابية او موقع ويب او برنامج او تطبيق الكتروني او الى لعبة الكترونية."
    ,"span_tow":"لماذا يجب عليك تعلم البرمجة",
    "span_tow_p":"تعد البرمجة من اهم التخصصات المطلوبة في سوق العمل حيث يتجه العالم الى التكنلوجيا والانترنت كما ان تعلم البرمجة كما يساعد على حل المشكلات وتوفر لك تصميم اي شيء تريده من موقع الكتروني او برنامج او لعبة وغيره كما ان البرمجة تحقق دخلا مرتفعا لأنها من المهن الاكثر طلبا في المستقبل.",
    "span_three":"اهمية تعلم البرمجة",
    "span_three_p":"تتمحور اهمية البرمجة في انها تستخدم في جميع البرامج الالكترونية وتطبيقات الهاتف الذكي وتستخدم ايضا في تصميم وتطوير المواقع الالكترونية التي تساعد الاشخاص على القيام بمهام معينة فالبرمجة تعمل على تطوير التفكير وتعلم الشخص التفكير المنطقي وحل المشكلات.",
    "span_four":"مسارات تعلم البرمجة",
    "span_four_p":"قبل ان تتعلم اول لغة برمجة عليك اولا تحديد مسارك البرمجي فهناك العديد من المسارات اهمها-:",
    "Web_Development":"1:تطوير الويب",
    "Web_Development_p":"يعتبر تطوير الويب من اكثر المسارات انتشارا وتعلما بسبب الطلب الكبير على المواقع الالكترونية يقسم هذا المسار لقسمين:-",
    "Frontend_Developer_Design":"1:تصميم الواجهة الامامية-frontend developer",
    "Frontend_Developer_Design_p":" وهي تعني تصميم وتنسيق الموقع من حيث الالوان والنصوص ونوع الخطوط والصور وغيرها من الامور التي يتفاعل معها الزاىْر اهم لغة لتصميم الموقع وتنسيقه لغةcss.",
    "backend_developer_development":"2:تطوير الواجهة الخلفية-backend-developer",
    "backend_developer_development_p":"يتمثل هذا المسارفي معالجة البيانات وارسالها الى الخادم والتعامل مع المتصفح حيث يتم استخدام العديد من لغات الbackend مثل php,python,java",
    "Mobile_Apps":"3:تطبيقات الهواتف",
    "Mobile_Apps_P":"يقوم هذا المجال بتصميم البرامج التي تكون على الهواتف الذكية وتقسم تطبيقات الهاتف الذكية الى",
    "Native_applicattion_p":"يقصد بها البرامج التي تعمل على نظام محدد مثل نظام android و iphone.",
    "Hybrid_application_p":"يقصد بها التطبيقات التي تعمل على اكثر من نظام",
    "Desktop_Software":"4:برامج سطح المكتب",
    "Desktop_Software_p":"يقصد بها البرامج التي تعمل على جهاز الحاسوب من الامثلة على برامج سطح المكتب (برامج مكافحة الفايروسات وبرامج فك الضغط وبرامج الفوتوشوب) بعض لغات التي تستخدم في انشاء برامج سطح المكتب java,python    ",
    "Games":"4:الالعاب الالكترونية",
    "Games_p":"يتم استخدام محرك unity الذي يستخدم في تطوير الالعاب الالكترونية كما انه احد اشهر المحركات المستخدمة في تطوير الالعاب ويستخدم لغة برمجة اسمها سي شارب (c#)",
     "span_five":"ماذا تحتاج لتعلم البرمجة",
    "span_five_p":"هناك بعض الامور التي تحتاجها لتبدا رحلتك في تعلم البرمجة اهمها:-",
    "Computer":"1:جهاز حاسوب",
    "Computer_p":"تحتاج الى جهاز حاسوب بسيط ليس ذو قدرات خارقة لان عملية كتابة الاكواد تحتاج الى امكانيات بسيطة الا اذا كنت تتعلم اللغات الخاصة بتخزين البيانات والتعامل مع قواعد البيانات مثل لغة mysql حينها تحتاج الى حاسوب ذو قدرات خارقة",
     "code_editor":"2:برنامج لكتابة الاكواد البرمجية",
    "code_editor_p":"تحتاج ايضا برنامج لتحرير الاكواد البرمجية انصح بهذه البرامج",
    "if_p":"اذا لم يكن لديك جهاز حاسوب يمكنك تعلم البرمجة على الهاتف الذكي انصح بهذا البرنامج للهواتف ",
    "span_six":"نهاية المقال",
    "span_six_p":"كما انك تحتاج للصبر فالبرمجة تحتاج الى ممارسة لكي تصل الى الاحتراف لقد ذكرنا كل ما يتعلق في البرمجة امل ان تكونوا قد استفدتم من المقال اي شخص لديه سؤال تفضل وقم بمراسلتنا على مواقع التواصل الاجتماعي او عبر الايميل الخاص بالمدونة شكرا لكم."
    }]