[{
    "title_articles":"All about programming",
    "contents_the_articles":"contents the article",
    "link_one":"what is programming",
    "link_tow":"why you should learn programming",
    "link_three":"the important of learn programming",
    "link_four":"programming learning paths",
    "link_five":"what you need to learn programming",
    "link_six":"The end of article",
    "the_start":"Wellcom to barmaja blog...",
    "about":"in this article we will talk about every thing about programming.",
    "span_one":"what is programming ?",
    "programming":"programming",
    "programming_p":"It is writing commands for the computer to translate and execute them, where the code writer (programmer) writes commands or instructions, then the computer converts the commands or instructions to the thing or idea that the programmer wants from a calculation process, website, program, electronic application, or to an electronic game.",
    "span_tow":"why you should learn programming",
    "span_tow_p":"Programming is one of the most important disciplines required in the labor market as the world is moving to technology and the Internet, and learning programming helps to solve problems and provides you with the design of anything you want from a website, program, game, etc., and programming achieves a high income because it is one of the most demanded professions in the future.",
    "span_three":"the important of learn programming",
    "span_three_p":"The importance of programming is that it is used in all electronic programs and smartphone applications and is also used in the design and development of websites that help people to carry out certain tasks, programming works to develop thinking and teach the person logical thinking and problem solving.",
    "span_four":"programming learning paths",
    "span_four_p":" Before you learn the first programming language, you must first determine your programming path, there are many paths, <mark class='special_span'>the most important paths:-</mark>",
    "Web_Development":"1:Web Development",
    "Web_Development_p":"Web development is one of the most widespread and learned paths due to the high demand for websites, this track is divided into two parts.",
    "Frontend_Developer_Design":"1:Frontend Developer Design",
    "Frontend_Developer_Design_p":"It means the design and coordination of the site in terms of colors, texts, type of fonts, images and other things that the visitor interacts with The most important language for website design and coordination is CSS.",
    "backend_developer_development":"2:backend-developer development",
    "backend_developer_development_p":"This path consists in processing data and sending it to the server and dealing with the browser where many backend languages are used such as php, python and java.",
    "Mobile_Apps":"3:Mobile Apps",
    "Mobile_Apps_P":"This field designs programs that are on smartphones and divides smartphone applications into.",
    "Native_applicattion_p":"It means programs that run on a specific system such as Android and iPhone.",
    "Hybrid_application_p":"It means applications that run on more than one system.",
    "Desktop_Software":"4:Desktop Software",
    "Desktop_Software_p":"It means programs that run on a computer Examples of desktop programs (anti-virus programs, decompression programs and Photoshop programs) Some languages that are used to create desktop programs Java and Python.",
    "Games":"Games",
    "Games_p":"The Unity engine, which is used in the development of electronic games, is also one of the most famous engines used in the development of games and uses a programming language called C Sharp C#.",
    "span_five":"what you need to learn programming",
    "span_five_p":"There are some things you need to start your journey in learning programming, the most important of which are:",
    "Computer":"1:Computer",
    "Computer_p":"You need a simple computer that does not have supernatural capabilities because the process of writing code needs simple capabilities unless you are learning languages for storing data and dealing with databases such as mysql Then you need a computer with superpowers.",
    "code_editor":"2:code editor",
    "code_editor_p":"You also need a program to edit the codes, I recommend these programs:",
    "if_p":"f you don't have a computer, you can learn to code on your smartphone I recommend this program for phones:",
    "span_six":"The end",
    "span_six_p":"You also need patience, programming needs practice in order to reach professionalism We have mentioned everything related to programming, I hope that you have benefited from the article, anyone who has a question, please send us a message on social networking sites or via the blog's e-mail, thank you."
    }]